buoyantPimpleFoam_timevaryingBC/fine_timevaryingCavityFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    frontAndBack
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    hot
    {
	type		uniformFixedValue;
	uniformValue
	{
            type            csvFile;
            nHeaderLine     1;
            refColumn       0;
            componentColumns ( 1 );
            separator       ",";
            mergeSeparators no;
            file            "<constant>/temp_profile.csv";
        }

    }

    cold
    {
        type            fixedValue;
        value           uniform 300.0; 
    }
}


// ************************************************************************* //
