buoyantPimpleFoam_timevaryingBC/fine_timevaryingCavityFoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    frontAndBack
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    topAndBottom
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    hot
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    cold
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
}


// ************************************************************************* //
